Revit 2027 API
StructuralSectionUtils Methods
The StructuralSectionUtils type exposes the following members.
Methods
Name | Description
GetStructuralElementDefinitionData |  Return structural element definition data.
GetStructuralSection |  Return structural section from element.
SetStructuralSection |  Set structural section in element.
Top
See Also
Reference
StructuralSectionUtils Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace